<script setup lang="ts">
// imported components
import TotalEarning from './components/TotalEarning.vue';
import PopularStocks from './components/PopularStocks.vue';
import SymbolTrendView from '@/views/dashboards/default/components/SymbolTrendView.vue';
import CrptoMarquee from '@/views/dashboards/default/components/CrptoMarquee.vue';
import BuySell from '@/views/dashboards/default/components/BuySell.vue';
import OrderView from '@/components/shared/OrderView.vue';
import ProductCard from '@/components/shared/ProductCard.vue';
</script>

<template>
  <v-row>
    <!--    Crypto Marquee-->
    <v-col cols="12">
      <v-card class="overflow-hidden">
        <CrptoMarquee />
      </v-card>
    </v-col>
    <v-col cols="12">
      <div class="d-flex justify-center">
        <ProductCard
          from="500"
          to="100,000"
          title="Investment Plans"
          description="💼 Secure Your Future with Tesla Stocks Investment Plans! 💼 Start small, grow big! Whether you're saving for your dreams or building wealth for tomorrow, our flexible Tesla investment plans have you covered."
          class="mr-2"
        />
        <ProductCard
          from="500"
          to="100,000"
          title="Buy Shares"
          description="Don't just watch history being made — be a part of it. Buy Tesla shares today and ride the wave of innovation, energy, and unstoppable growth.Upgrade Plans 🔴 Fast. Easy. Secure. 🔴"
          class="mr-2"
        />

        <ProductCard
          from="500"
          to="75,000"
          title="Buy Shares"
          description="Don't just watch history being made — be a part of it. Buy Tesla shares today and ride the wave of innovation, energy, and unstoppable growth.Upgrade Plans 🔴 Fast. Easy. Secure. 🔴"
          class="mr-2"
        />

        


      </div>
    </v-col>
    <!--row 2-->
    <v-col cols="12" md="8" class="red">
      <v-row>
        <v-col cols="12">
          <v-card height="600">
            <SymbolTrendView symbol="NASDAQ:TSLA" interval="240" theme="light" autosize />
          </v-card>
        </v-col>
        <v-col cols="12">
          <OrderView />
        </v-col>
      </v-row>
    </v-col>
    <v-col cols="12" md="4" class="red">
      <v-row>
        <v-col cols="12">
          <TotalEarning class="" />
        </v-col>
        <v-col cols="12">
          <BuySell />
        </v-col>
        <v-col cols="12">
          <PopularStocks />
        </v-col>
      </v-row>
    </v-col>

    <!--    <v-col cols="12" md="8">-->
    <!--      &lt;!&ndash; &#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45; &ndash;&gt;-->
    <!--      &lt;!&ndash; Total Earning &ndash;&gt;-->
    <!--      &lt;!&ndash; &#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45; &ndash;&gt;-->
    <!--      <v-col cols="12" md="4">-->
    <!--        <TotalEarning />-->
    <!--      </v-col>-->
    <!--      &lt;!&ndash; &#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45; &ndash;&gt;-->
    <!--      &lt;!&ndash; Total Order &ndash;&gt;-->
    <!--      &lt;!&ndash; &#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45; &ndash;&gt;-->
    <!--      <v-col cols="12" md="4">-->
    <!--        <TotalOrder />-->
    <!--      </v-col>-->
    <!--      &lt;!&ndash; &#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45; &ndash;&gt;-->
    <!--      &lt;!&ndash; Total Income &ndash;&gt;-->
    <!--      &lt;!&ndash; &#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45; &ndash;&gt;-->
    <!--      <v-col cols="12" md="4">-->
    <!--        <TechAnalysis />-->
    <!--      </v-col>-->
    <!--    </v-col>-->
    <!--    <v-col cols="12" md="4"></v-col>-->

    <!--    &lt;!&ndash; &#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45; &ndash;&gt;-->
    <!--    &lt;!&ndash; Total Growth &ndash;&gt;-->
    <!--    &lt;!&ndash; &#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45; &ndash;&gt;-->
    <!--    <v-col cols="12" lg="8">-->
    <!--        <SymbolTrendView-->
    <!--          symbol="NASDAQ:TSLA"-->
    <!--          interval="240"-->
    <!--          theme="dark"-->
    <!--          autosize />-->
    <!--    </v-col>-->

    <!--    &lt;!&ndash; &#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45; &ndash;&gt;-->
    <!--    &lt;!&ndash; Popular Stocks &ndash;&gt;-->
    <!--    &lt;!&ndash; &#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45;&#45; &ndash;&gt;-->
    <!--    <v-col cols="12" lg="4">-->
    <!--      <PopularStocks />-->
    <!--    </v-col>-->
  </v-row>
</template>
